package com.example.akmu.pig_app_new;

import android.app.Fragment;
import android.content.Intent;
import android.content.res.Configuration;
import android.graphics.Color;
import android.os.Bundle;
import android.support.v7.app.ActionBar;
import android.text.Html;
import android.view.Gravity;
import android.view.LayoutInflater;
import android.view.View;
import android.view.ViewGroup;
import android.widget.Button;
import android.widget.LinearLayout;
import android.widget.TextView;

/**
 * Created by akmu on 12/15/2017.
 */

public class eight_fragment extends Fragment {

    public eight_fragment() {
    }



    public String[] to_be_used = {
            " शूकर पालन एप्प",
            "शूकर रोग",
            "  जीवाणु एवं विषाणु जनित रोग " ,
            "1. स्वाइन फीवर/शूकर ज्वर/हाॅग कालरा " ,
            " क्या एवं कैसे " ,
            "यह एक संक्रामक रोग है और तीव्र गति से फैलता है। वृद्ध शूकरों की अपेक्षा कम आयु के शूकरों में इस रोग की संभावना अधिक होती है यह एक विषाणु द्वारा होता है, यह बीमारी प्रायः शूकरों के गंदगी में घूमने, बिना उबाले रसोई का बचा हुआ खाना या वधशाला का मांस, आहार के रूप में देने से होता है। " ,
            " लक्षण " ,
            "भूख न लगना, उदासी, तेज बुखार, कमजोरी, लड़खड़ाना एवं पलकों का चिपक जाना । शुरूआत में कब्ज, दस्त, त्वचा पर विशेष तरह की विकृति का पाया जाना जिसमें बाल गिरना, चकत्ता बनना और शरीर की त्वचा का गहरा नीला पड़ना प्रमुख हैं।" ,
            " रोकथाम " ,
            "शूकर बाड़ों की सफाई पर विशेष ध्यान रखना चाहिए। बाड़ों व बर्तनो को संक्रमण-रहित करने की व्यवस्था होनी चाहिए। इस बीमारी से बचने के लिए शूकरों का टीकाकरण ही एकमात्र उपाय है। शूकर बाड़े में 5% क्रीसोल या 3% सोडियम हाइड्रोक्साइड का छिड़काव करना चाहिए।",
            "शूकर चेचक/स्वाइन पाॅक्स " ,
            " क्या एवं कैसे " ,
            "तेजी से संक्रमित होने वाला यह रोग विषाणुओं (स्वाइन पाक्स) के द्वारा होता है। " ,
            " लक्षण  " ,
            "पशु को हल्का बुखार रहता है। एक-दो दिन में शरीर के निचले भाग, पैर के ऊपरी भाग, चेहरे पर तथा पीठ के पिछले भाग पर छोटे-छोटे दाने निकल आते हैं और वे 1-2 दिन बाद बड़े हो जाते हैं जिनमें 3-4 दिन में मवाद भर जाता है और जल्द ही पपड़ी बन जाती है। " ,
            " उपचार एवं रोकथाम " ,
            "रोग-ग्रस्त समूह को अलग रखकर उन्हे हल्का भोजन प्रदान करना चाहिए । शूकर में परजीवी जैसे जूँ और किलनियों पर नियन्त्रण रखने के लिए समय-समय पर उपचार होना चाहिए तथा बाड़ों की सफाई पर विशेष ध्यान देना चाहिए । चेचक के दानों में हुए घावों पर नीली दवा लगाना चाहिए और बी-काॅम्प्लेक्स का इंजेक्शन देना चाहिए।",
            "2. शूकर प्लेग/गलघोंटू रोग  " ,
            " क्या एवं कैसे " ,
            "यह रोग पास्चुरेला मल्टोसिडा नामक जीवाणु से फैलता है। न्यूमोनिक पास्चुरेलोसिस जो फेफड़ों में निमोनिया रोग फैलाता है। सेप्टिसिमिक पास्चुरेलोसिस, जो अधिकतर बच्चो मे होता है और अत्यन्त खतरनाक होता है।\n" +
                    " लक्षण " ,
            "तेज बुखार, भूख न लगना, लड़खड़ाना, साँस लेने में तकलीफ, गले में सूजन एवं दस्त। " ,
            " उपचार एवं रोकथाम" ,
            "रोग-ग्रस्त पशुओं को अलग रखना चाहिए, बाड़े की सफाई करनी चाहिए, मरे हुए पशुओं को जला देना चाहिए या जमीन में दबा देना चाहिए एवं चूने का भी उपयोग करना आवश्यक है। एच. एस. आॅयल एडजूवेन्ट या एच. एस. ब्राॅथ वैक्सीन का टीकाकरण करना चाहिए। आक्सीटेट्रासाईक्लिन के साथ डेक्सोना का इंजेक्शन देना लाभदायक होता है। " ,
            "3. खुरपका - मुँहपका रोग  " ,
            " क्या एवं कैसे " ,
            "यह विषाणु-जनित एक भयानक संक्रामक रोग है।  " ,
            " लक्षण  " ,
            "तेज बुखार, मुँह, जीभ तथा खुरों के आस-पास छाले बन जाते हैं। पशु खाना नहीं खाता और उसे बहुत प्यास लगती है। दर्द के कारण वह चलने में असमर्थ हो जाता है। " ,
            " उपचार एवं रोकथाम " ,
            " रोग-ग्रसित पशु को अलग रखना चाहिए, स्वच्छता पर पूरा ध्यान देना चाहिए, रोगी पशु के मुँह को दोनों समय फिटकिरी या पोटैशियम परमैंगनेट के घोल से धोना चाहिए एवं बोरो-ग्लिसरीन लगाना चाहिए। रोगी पशु के खुरों के उपचार हेतु पानी में 2% फिटकरी या पोटेशियम परमैंग्नेट का घोल लगाकर पट्टी बाँधना चाहिए। पाॅलीवेलेन्ट एफ.एम.डी. वैक्सीन का पहला टीका माॅ से अलग करने के बाद (वीनिंग) लगा देना चाहिए । शूकर बाड़े को 1-2% सोडियम हाइड्राक्साइड अथवा फार्मिलिन/4% सोडियम कार्बोनेट से साफ करना चाहिए तथा रोग ग्रस्त पशु का बिछावन एवं उनके उत्पाद को अवश्य जला देना चाहिए।" ,
            "4. पोरसाइन रेस्पिरेटरी रिप्रोडक्टिव सिंड्रोम (पी.आर.आर.एस.) " ,
            " क्या एवं कैसे " ,
            "यह रोग आर्टेरि विषाणु द्वारा होता है।" ,
            " लक्षण " ,
            "इस बीमारी से ग्रस्त होने पर मादा प्रायः मरे हुए (ममीफाईड) बच्चे देती है। यदि मादा जीवित बच्चे देती भी है तो शावको के शरीर पर बाल नहीं होते है तथा बच्चे अपंग पैदा होते हैं।" ,
            " उपचार एवं रोकथाम " ,
            "इसका कोई भी आसान उपचार उपलब्ध नहीं है, परन्तु विभिन्न दवाईयों द्वारा जिनमें कि रेस्टोबाॅल, मिन्ट्रस आदि प्रमुख हैं, मादा के शरीर में रोग प्रतिरोधक क्षमता उत्पन्न की जा सकती है तथा इस रोग से होने वाली हानि को रोका जा सकता है। " ,
            "5. संक्र्रामक गर्भपात ",
            " क्या एवं कैसे ",
            "यह ब्रूसेला स्विस, लेप्टोस्पायरा और ट्रायकोमोनास नामक जीवाणु के द्वारा होता है। " ,
            " लक्षण  " ,
            "शूकरियों में बाँझपन, गर्भपात, जोड़ों का रोग, दुर्बल शावकों  का जन्म होना, नर शूकरों में वृषणशोथ इत्यादि। " ,
            "रोकथाम " ,
            "रोगी पशु को अलग कर उसका वध कर देना चाहिये। गर्भपात के दौरान मृत जन्मे बच्चों को जमीन के अन्दर दबा देना चाहिए। दूसरे बाड़े से लाए गए शूकरों को अलग रखकर ब्रूसेलौसिस की जाँच कर लेनी चाहिए एवं बाडे़ को साफ रखना चाहिए। इस बीमारी का उपचार उपलब्ध नहीं है।" ,
            "6. शूकर पैराटाईफाॅइड " ,
            " क्या एवं कैसे" ,
            "यह एक जीवाणु-जनित रोग है। यह तीव्र व चिरकालिक दोनों प्रकार का होता है। " ,
            " लक्षण  " ,
            "बुखार, भूख न लगना एवं शरीर के कई हिस्सों में लाल या बैंगनी रंग के चकत्ते बनना । " ,
            " रोकथाम " ,
            "शूकर बाड़ों की सफाई पर विशेष ध्यान रखना चाहिए। बाड़ों व बर्तनो को संक्रमण-रहित करने की व्यवस्था होनी चाहिए। " ,
            "7. एरिसिपेलस रोग/डायमण्ड त्वचा रोग " ,
            " क्या एवं कैसे " ,
            "यह रोग एरिसिपेलोथ्रिक्स रूजियोपैथी नामक जीवाणु से होता है जो कि सामान्य ताप पर कई महीनों तक इन्कुबेशन अवस्था में जीवित रह सकता है। " ,
            " लक्षण  " ,
            "शरीर के जोड़ सूज जाते हैं और पशु लंगड़ा हो जाता है। पशु चलने की इच्छा नहीं रखता है। तेज बुखार के साथ शरीर पर छोटे गुलाबी या हल्के पीले रंग के चकत्ते दिखना है। " ,
            " उपचार एवं रोकथाम " ,
            "रोगग्रस्त समूह को स्वस्थ समूह से अलग रखना तथा उन्हे संतुलित आहार देना । इस रोग का इलाज पेनिसिलीन तथा एंटी-एरिसिपेलस सीरम द्वारा किया जा सकता है। यह इंजेक्शन रोगग्रस्त शूकरों के कान के पीछे लगाना चाहिए। अप्रैल व मई के महीनों में टीकाकरण करना चाहिए। " ,
            "8. स्वाइन वेसिकुलर इक्जैंथिमा " +
                    " क्या एवं कैसे " +
                    "यह कैलिसी वायरस विषाणु द्वारा होता है और आमतौर से बड़े पशुओं में दिखता है। यह कूड़ा-करकट खाने से होता है। " +
                    " लक्षण " ,
            "मुँह और पैरों पर छाले बनना। " +
                    " रोकथाम " ,
            "शूकर बाड़ों की सफाई पर विशेष ध्यान रखना चाहिए। बाहर से आने वाले पशुओं की अच्छी प्रकार से जाँच-पड़ताल करके ही उन्हें बाड़े में शामिल करना चाहिए। 2% सोडियम हाइड्रोक्साइड से शूकर बाड़े व बर्तनों को पूर्णतया साफ करना चाहिए। ",
            "  परजीवी रोग " ,
            "1. अंतःपरजीवी  " ,
            " क्या एवं कैसे  " ,
            " अंतःपरजीवी जैसे गोलकृमि एवं फीताकृमि इत्यादि हैं।  " ,
            " लक्षण " ,
            "इनकी संख्या ज्यादा होने पर शूकरों में दस्त, रक्ताल्पता, भूख न लगना तथा कमजोरी भी आ जाती है। कई बार ये परजीवी संक्रमण शूकरों के मौत का कारण भी बन जाते हैं। मल परीक्षण करके इन अंतःपरजीवी रोगों की जाँच की जा सकती है। " ,
            " उपचार एवं रोकथाम  " ,
            "एलबेन्डाजोल (5-10 मिग्रा/किग्रा शरीर भार), फेन्बेन्डाजोल (5 मिग्रा/किग्रा शरीर भार), पाइपराजीन(110 मिग्रा/किग्रा शरीर भार) एवं आइवरमेक्टिन (0.3 मिग्रा/किग्रा शरीर भार)में से किसी एक औषधि का प्रयोग कर सकते हैं। इन औषधियों द्वारा हर 4 महीनों पर अंतःपरजीवियों की रोकथाम करना अति आवश्यक है। " ,
            "2. बाह्य परजीवी " ,
            " क्या एवं कैसे " ,
            "बाह्य परजीवी में माइट, जूँ, मक्खी, पिस्सू, चमोकन आदि प्रमुख हैं।  " ,
            " लक्षण " ,
            "इनके कारण खुजली होती है और शूकर दीवार से अपने शरीर को रगड़ते हैं जिससे उनका शरीर लाल पड़ जाता है तथा त्वचा में घाव बन जाता है। कभी-कभी उपचार न होने से घाव में कीड़े भी पड़ जाते हैं। इनके कारण पशु परेशान होते हैं, खाना-पीना कम कर देते हैं और उनका वजन घट जाता है। " ,
            " उपचार एवं रोकथाम  " ,
            "आइवरमेक्टिन इंजेक्शन 0.3 मिग्रा/किग्रा शरीर भार माँसपेशियों में देना चाहिए। ब्यूटाॅक्स (डेल्टामेथ्रीन), एक्टोमिन, एस्केबियाल(अमिटराज)-एक लीटर पानी में 2 मिली दवाई के घोल का पूरे शरीर पर छिड़काव करना चाहिए, और इसे 15 दिन बाद दोहराने से बाह्य परजीवियों से छुटकारा मिल जाता है। दवाई का छिड़काव करने से पूर्व यह सुनिश्चित कर लेना चाहिए कि पशु पर्याप्त पानी पी चुके हों ताकि वें दवा को न चाट सकें । दवाई-छिड़काव का कार्य धूप में करना चाहिए ।",
            "  खनिज लवण व विटामिनों की कमी से होने वाले रोग " ,
            "हरे चारे के न मिलने के फलस्वरूप उनमें खनिज लवण एवं विटामिनों की कमी होने की संभावना बनी रहती है। इनकी कमी के कारण शूकरों की वृद्धिदर घटती है। " ,
            "1. एनीमिया (खून की कमी) " ,
            " क्या एवं कैसे " ,
            "यह आयरन, काॅपर, कोबाल्ट व विटामिन-बी की कमी से होता है। इससे शूकरों के खून में हिमोग्लोबीन की मात्रा काफी कम हो जाती है। " ,
            " लक्षण  " ,
            "भूख न लगना, दुर्बलता, साँस लेने में तकलीफ, सिर व कंधों में सूजन एवं अन्त में मृत्यु। दूध पीते बच्चो में इसकी ज्यादा संभावना होती है। वे पत्थर या मिट्टी चाटते हैं।" ,
            " उपचार एवं रोकथाम " ,
            "1. 450 ग्राम फेरस सल्फेट + 75 ग्राम काॅपर सल्फेट + 450 ग्राम शुगर + 2 ली पानीके मिश्रण को मादा के थन पर लगाना चाहिए। " ,
            "2. खुले बाड़े में शूकर शिशुओं को मिट्टी की उपलब्धता मिलने पर इसकी रोकथाम संभव है। " ,
            "3. 2 मिली आयरन डेक्स्ट्रान इंजेक्शन तीन दिन एवं तीन सप्ताह की आयु पर देना चाहिए। " ,
            "2. पैराकेराटोसिस " ,
            " क्या एवं कैसे " ,
            "जिंक अल्पता पैराकेराटोसिस नाम से जानी जाती है।  " ,
            " लक्षण " ,
            "त्वचा सामान्य से अधिक मोटी और खुरदरी हो जाती है। त्वचा के प्रभावित हिस्सों से बाल गिरने लगते हैं। कभी-कभी संपूर्ण शरीर के बाल गिर जाते हैं। शूकर के शरीर भार में कमी होने लगती है। जिंक की कमी से उत्पन्न त्वचा रोग के लक्षण स्केबीज और मैंज से मिलते-जुलते हैं। " ,
            " उपचार एवं रोकथाम " ,
            "खनिज लवण मिश्रण पर्याप्त मात्रा में राशन में मिलाकर देना चाहिए। " ,
            "3.विटामिन-ए की अल्पता " ,
            " क्या एवं कैसे " ,
            "विटामिन-ए की अल्पता या तो राशन में इसकी कमी के कारण होती है अथवा पूर्णरूप से आँतों द्वारा अवशोषण न होने के कारण होती है।" ,
            " लक्षण " ,
            "शिशुओं में दिमाग का ठीक विकास नहीं होता और व्यस्क में रतौंधी नामक रोग हो जाता है। इसके अतिरिक्त त्वचा खुरदरी हो जाती है, आँखों की पुतली में श्वेतपन आ जाता है, शरीर भार में कमी हो जाती है तथा बच्चा पैदा करने में असमर्थता उत्पन्न हो जाती है। विटामिन-ए की कमी को शीघ्रता से ठीक करना चाहिए अन्यथा जो कुछ भी लक्षण दिखाई देते हैं, वे स्थाई हो जाते हैं। " ,
            " उपचार एवं रोकथाम " ,
            "1. विटामिन-ए की कमी होने पर 440 आई.यू. विटामिन-ए/किग्रा शरीर भार इंजेक्शन के रूप में दे सकते हैं। तुरन्त फायदे के लिए पानी-निर्मित इंजेक्शन का प्रयोग करते हैं तथा लम्बे समय तक के फायदे के लिए तैलीय पदार्थ में निर्मित विटामिन-ए को आहार मे मिश्रित करके भी दिया जा सकता है। विटामिन-ए की न्यूनतम प्रतिदिन की आवश्यकता 40 आई.यू./किग्रा शरीर भार की होती है।  " ,
            "2. विटामिन-ए की कमी से बचने के लिए पहले से आहार में रेटिनाॅल 0.3 माइक्रोग्राम या बीटा-कैरोटीन या5-8 माइक्रोग्राम/किग्रा शरीर भार की दर से प्रतिदिन दे सकते हैं। अथवा 50-60 दिनों के अंतराल पर 3000-6000 आई.यू./किग्रा शरीर भार की दर से भी विटामिन-ए राशन में मिलाकर खिलाते हैं। " ,
            "4. हाइपोग्लाइसीमिया " ,
            " क्या एवं कैसे " ,
            "रक्त में शुगर की मात्रा कम होना इस रोग का प्रमुख कारक है। " ,
            " लक्षण " ,
            "कंपकंपी, कमजोरी, दूध पिलाने में अस्मर्थता, बालों का सूखा व खड़ा हो जाना । 24 घंण्टे के अन्दर बच्चों का मरना । " ,
            " उपचार एवं रोकथाम " ,
            "1. डेक्सट्रोज का इंजेक्शन या ग्लूकोज पाउडर को पानी में देना चाहिए। " ,
            "2. नियमित रूप से खनिज लवण एवं विटामिन-पूरक शूकरों के राशन में 3% प्रयुक्त करना चाहिए। " ,
            "3. दिन के समय धूप पहुँचने की व्यवस्था सुनिश्चित करनी चाहिए।",
            "  टीकाकरण  " ,
            " शूकर ज्वर वैक्सीन राज्यों के पशु स्वास्थ्य एवं पशु जैविक उत्पाद संस्थान(चंडीगढ़, लखनऊ, कोलकाता, गौहाटी, बेंगलुरू, चेन्नई, थिरूअनन्तपुरमआदि) से प्राप्त की जा सकती है " ,
            " खुरपका मुॅहपका वैक्सीन राज्यों के सभी सरकारी पशु-चिकित्सालयों से प्राप्त की जा सकती है। " ,
            " टीके को बाजार से क्रय करने के बाद बर्फ के साथ थर्मोकोल डिब्बे में रख लेना चाहिए।  " ,
            " टीकाकरण का कार्य दो महीने से कम उम्र के बच्चों को छोड़कर समस्त शूकरों में एक साथ करना चाहिए।  " ,
            " टीकाकरण का कार्य बरसात प्रारम्भ होने से पहले पूरा कर लेना चाहिए।  " ,
            " टीकाकरण से 15-30 दिन पहले सभी पशुओं में पेट के कीड़ों को मारने वाली दवाई पिलाना अत्यधिक आवश्यक है।  " ,
            "  फार्म में उपयोग होने वाले कीटाणुनाषक " ,
            "फार्म में बीमारियों को रोकने के लिए बाड़ों के अंदर साफ-सफाई की आवश्यकता पड़ती है। बाड़ों को नीचे दिये गये विभिन्न कीटाणुनाशक से सही मात्रा में सही समय पर एवं सही तरीके से पानी के साथ धुलाई करने से बीमारियों को रोका जा सकता है। ",
            "रोग का नाम ",
            "आयु ",
            "मात्रा",
            "अवधि " ,
            "शूकर ज्वर",
            "3 माह पर/वीनिंग के बाद ",
            "1 मिली माँस त्वचा में " ,
            " 1 वर्ष " ,
            "खुरपका - मुँहपका ",
            "वीनिंग के बाद दूसरा प्रथम के 21 दिन बाद ",
            "5-10 मिली त्वचा के नीचे ",
            "6 माह",

            "नाम",
            "मात्रा " ,
            " उपयोग की विधि",
            "उपयोग की जगह",
            "टिप्पणी",

            "धुलाई का सोडा (सोडियम  कोर्बोनेट)",
            "उबलते पानी में 3% मिलायें",
            "छिड़काव",
            "फर्श, बर्तन ",
            "प्रभावी कीटाणुनाशक " ,

            "चूना",
            "0.5 किलो चूना़ + 5 लीटर पानी ",
            "चूने के पाउडर एवं  घोल का छिड़काव ",
            "फर्श, दीवार,  मैदान",
            "आवश्यकतानुसार ताजा घोल तैयार करें " ,

            "पोटेशियम परमैंगनेट (लाल दवा)",
            "1:10000 घोल पानी में",
            "छिड़काव",
            "फर्श, गडढा,  बर्तन ",
            "कीटाणुनाशक कार्य आक्सीडेशन के माध्यम से " ,

            "फिनाॅयल (कारवोलिक ऐसिड)",
            "2-5% घोल पानी में",
            "छिड़काव",
            "धातू, वस्तु,  कपडे़",
            "अच्छा कीटाणुनाशक" ,

            "फौैरमेलिन (40 प्रतिशत फौरमलडिहाइड)",
            "15 मिली फौरमेलिन + 15 ग्राम पोटेशियम परमैंगनेट प्रति 15 वर्ग मीटर जगह के लिए",
            "फ्युमिगेशन",
            "बाड़ा ",
            "शूकर को बाड़े में बंद करने से पहले दरवाजे व खिड़की खोलना जरूरी है " ,

            "कापर सल्फेट (नीली दवा)",
            "1 ग्राम + 1000 लीटर पानी ",
            "छिड़काव",
            "पानी का गड्डा ",
            "फॅगस तथा एल्गी की वृद्धि रोकता है " ,

            "सोडियम हाइड्राक्साइड",
            "सामान्य उपयोग के लिए 2% तथा जीवाणुओं को  मारने के लिए 5%",
            "छिड़काव",
            "फर्श, गटर, उपकरण",
            "धातु संक्षारक, सस्ती, अच्छी कीटाणुनाशक" ,

            "ब्लीचिंग पाउडर (कैल्शियम हाइपोक्लोराइट)",
            "30% उपलब्ध क्लोरीन",
            "छिड़काव",
            "फर्श, गटर",
            "सूर्य की रोशनी से बचाना चाहिए " ,

            "क्वाटरनरी अमोनियम लवण",
            "1% घोल",
            "पोछा/ धोना",
            "थन, हाथ",
            "ग्राम पोजिटिव एवं निगेटिव बैक्टीरिया के खिलाफ अधिक प्रभावी जीवाणुनाशक" ,

            "बोरिक अम्ल ",
            "5 से 6% घोल",
            "छिड़काव",
            "त्वचा, फर्श,  दीवार, उपकरण" ,
            "-",

            "सोडियम हाइपोक्लोराइट ",
            "200 पी.पी.एम. उपलब्ध क्लोरीन",
            "पोछा ",
            "बर्तन, थन ",
            "गर्म घोल का प्रयोग नही करना चाहिये"


    };


    TextView text1;



    Button button1;
    Button button2;
    Button button3;
    Button button4;
    Button button5;


    @Override
    public View onCreateView(LayoutInflater inflater, ViewGroup container, Bundle savedInstanceState) {

        View view = inflater.inflate(R.layout.eight_fragment_layout, container, false);




        getActivity().setTitle(to_be_used[0]);

        text1 = (TextView) view.findViewById(R.id.text1);



        text1.setText(to_be_used[1]);



        button1=(Button)view.findViewById(R.id.button1);
        button2=(Button)view.findViewById(R.id.button2);
        button3=(Button)view.findViewById(R.id.button3);
        button4=(Button)view.findViewById(R.id.button4);
        button5=(Button)view.findViewById(R.id.button5);

        button1.setText(to_be_used[2]);
        button2.setText(to_be_used[61]);
        button3.setText(to_be_used[76]);
        button4.setText(to_be_used[111]);
        button5.setText(to_be_used[118]);



        button1.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View view) {

                Intent intent = new Intent(getActivity(),Main3Activity.class);
                intent.putExtra("number","1");
                startActivity(intent);
            }
        });
        button2.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View view) {


                Intent intent = new Intent(getActivity(),Main3Activity.class);
                intent.putExtra("number","2");
                startActivity(intent);
            }
        });
        button3.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View view) {


                Intent intent = new Intent(getActivity(),Main3Activity.class);
                intent.putExtra("number","3");
                startActivity(intent);
            }
        });
        button4.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View view) {



              Intent intent = new Intent(getActivity(),Disease_activity.class);
                intent.putExtra("number","16");
              startActivity(intent);
            }
        });
        button5.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View view) {



                Intent intent = new Intent(getActivity(),Disease_activity.class);
                intent.putExtra("number","17");
                startActivity(intent);
            }
        });












        return view;
    }
    @Override
    public void onConfigurationChanged(Configuration newConfig) {
        super.onConfigurationChanged(newConfig);
    }
}